speelein/ESP32-mit-OTA-Client/src/main.cpp

// Fuer DHT
// DHT Temperature & Humidity Sensor
// treiber fuer zwei CO2 Sensoren MHZ19 und SCD30
// ESP8266 MQ135 CO2 MQ7 MQ6 MQ5 MQ4 Luft Air Gas CO2
// Unified Sensor Library Example
// Written by Guenter Pruefer
// Released under ..........

// REQUIRES the following Arduino libraries:
// - DHT Sensor Library: https://github.com/adafruit/DHT-sensor-library
// - Adafruit Unified Sensor Lib: https://github.com/adafruit/Adafruit_Sensor
// - #include <Arduino.h>
// - <Wire>
// - <WiFi.h>
// - <ESPmDNS.h> // Gibt ev. per DNS IP Upload frei
// - <WiFiUdp.h>
// - <ArduinoOTA.h> Update per Wlan
// - <LiquidCrystal_I2C.h> fuer Display over I2C
// - <WiFiUdp.h>
// - "time.h"
// - <ctime>
// - <stdio.h>
// - <iostream>
// - <chrono>
// - <SPI.h>
// - "SparkFun_SCD30_Arduino_Library.h" CO2 Sensor Click here to get the library: http://librarymanager/All#SparkFun_SCD30
// - <ESP8266WiFi.h>  
// - <ESPAsyncTCP.h>
// - <ESPAsyncWebServer.h>
// - <string.h>
// - <stdlib.h>
// - <InfluxDbClient.h>
// - Fuer SD-CardReader
// - "FS.h"
// - "SD.h"
/*
<form action="/get">    
Anfang Nacht: 
<input type="number" step="0.01" name="input2">    
<input type="submit" value="Submit">  
</form><br>  
<form action="/get">    
Ende Nacht: 
<input type="number" step="0.01" name="input3">    
<input type="submit" value="Submit">

*/
// For a connection via I2C using the Arduino Wire include:
#include <Wire.h> // Only needed for Arduino 1.6.5 and earlier

#include <Adafruit_Sensor.h> // allgemein fuer Adafruitumgebung noetig
#include <DHT.h>             // Temperatursensor
#include <DHT_U.h>           // Temperatursensor
#include <SPI.h>
// FUer OTA noetig
#include <WiFi.h>
#include <ESPmDNS.h> // Gibt ev. per DNS IP Upload frei
#include <WiFiUdp.h>
#include <ArduinoOTA.h>
// HD44780 steuert LiquidCrystal I2C
#include <LiquidCrystal_I2C.h>


// Zeitserver
#ifdef ESP8266
#include <ESP8266WiFi.h>
#include <TZ.h>
#else // ESP32
#endif
#include <ESPPerfectTime.h>


//#include "SparkFun_SCD30_Arduino_Library.h" //Click here to get the library: http://librarymanager/All#SparkFun_SCD30
// SCD30 airSensor;

// Fuer Websever und Client


#include "time.h"
#include <ctime>
#include <stdio.h>
#include <iostream>
#include <chrono>
#include <Arduino.h>
#ifdef ESP32  
#include <WiFi.h>  
#include <AsyncTCP.h>
#else  
#include <ESP8266WiFi.h>  
#include <ESPAsyncTCP.h>
#endif
#include <ESPAsyncWebServer.h>
#include <string.h>
#include <stdlib.h>
#include <Arduino_JSON.h>
// Fuer SD-CardReader
#include "FS.h"
#include "SD.h"



// fuer InfluxDB
//#include <InfluxDbClient.h>
//#include <WiFiMulti.h>
//#include <InfluxDbCloud.h>

AsyncWebServer server(80);

// login
// WLAN SSID und Password
const char *host = "esp32";
const char *ssid = "5GH";
const char *password = "112330720040719440";

// Adresse und Zeilen fuer LCD
LiquidCrystal_I2C lcd(0x27, 20, 4); // set the LCD address to 0x27 for a 16 chars and 2 line display                            // Instantiate (create) a BMP280_DEV object and set-up for I2C operation (address 0x77)

// Variablendeklaration

float temperatur;  // Temperatur Messwert DHT 22
float huminity;    // Feuchte rel. Messwert DHT 22
float temp = 20; // Sollwert Raumtemperatur
float COx = 0;
float voltage = 0;
float tAusNacht = 20.00;
float tOnTag = 03.00;
float CO2 = 0;
// char input;


// fuer influxdb

// InfluxDB  server url. Don't use localhost, always server name or ip address.
// E.g. http://192.168.1.48:8086 (In InfluxDB 2 UI -> Load Data -> Client Libraries),
// const char* ssid = "*****";        //SSID
// const char* password =  "*****";   //Password

// #define INFLUXDB_URL "http://192.168.178.21:8086"
// #define INFLUXDB_TOKEN "*****"    //Token
// #define INFLUXDB_ORG "roomClimateData"
// #define INFLUXDB_BUCKET "roomClimate"
// InfluxDBClient client(INFLUXDB_URL, INFLUXDB_ORG, INFLUXDB_BUCKET, INFLUXDB_TOKEN);
// Point pointDevice("roomClimate");

// InfluxDB client instance
// InfluxDBClient client(INFLUXDB_URL, INFLUXDB_ORG, INFLUXDB_BUCKET, INFLUXDB_TOKEN);
// InfluxDB client instance for InfluxDB 1
//InfluxDBClient client(INFLUXDB_URL, INFLUXDB_DB_NAME);
// Data point
// Point sensor("wifi_status");
// #define DEVICE "ESP32"


#define DHTPIN 5 // Digital pin connected to the DHT sensor
// Feather HUZZAH ESP8266 note: use pins 3, 4, 5, 12, 13 or 14 --
// Pin 15 can work but DHT must be disconnected during program upload.

// Uncomment the type of sensor in use:
// #define DHTTYPE    DHT11     // DHT 11
#define DHTTYPE DHT22 // DHT 22 (AM2302)
// #define DHTTYPE    DHT21     // DHT 21 (AM2301)

DHT_Unified dht(DHTPIN, DHTTYPE);
#define analogPin 34

void printLocalTime()
{
  struct tm timeinfo;
  if (!getLocalTime(&timeinfo))
  {
    Serial.println("Failed to obtain time");
    return;
  }
}

const char* PARAM_INPUT_1 = "input1";

// HTML web page to handle 3 input fields (input1, .....)
const char index_html[] PROGMEM = R"rawliteral(<!DOCTYPE HTML>
<html>
<head>  
<title>ESP Input Form</title>  
<meta name="viewport" content="width=device-width, initial-scale=1">  
</head><body>
 
    
<h2> Temperatur einstellen </h2>
<p>bitte mit xx.xx grad eingegben und auf submit druecken</p><br>
<form action="/get">    
Temperartur: <br>
<input type="number" step="0.01" name="input1"><br>
Tag: <br>
<input type="number" step="0.01" name="input2"><br>
Nacht: <br>
<input type="number" step="0.01" name="input3"><br>
<input type="submit" value="Submit">

</form><br>
</body>
</html>)rawliteral";



void notFound(AsyncWebServerRequest *request) {  
  request->send(404, "text/plain", "Not found");
}

// Fuer SD-CardReader
/*
void listDir(fs::FS &fs, const char * dirname, uint8_t levels){
  Serial.printf("Listing directory: %s\n", dirname);
  File root = fs.open(dirname);
  if(!root){
    Serial.println("Failed to open directory");
    return;
  }
  if(!root.isDirectory()){
    Serial.println("Not a directory");
    return;
  }
  File file = root.openNextFile();
  while(file){
    if(file.isDirectory()){
      Serial.print("  DIR : ");
      Serial.println(file.name());
      if(levels){
        listDir(fs, file.name(), levels -1);
      }
    } else {
      Serial.print("  FILE: ");
      Serial.print(file.name());
      Serial.print("  SIZE: ");
      Serial.println(file.size());
    }
    file = root.openNextFile();
  }
}
void createDir(fs::FS &fs, const char * path){
  Serial.printf("Creating Dir: %s\n", path);
  if(fs.mkdir(path)){
    Serial.println("Dir created");
  } else {
    Serial.println("mkdir failed");
  }
}
void removeDir(fs::FS &fs, const char * path){
  Serial.printf("Removing Dir: %s\n", path);
  if(fs.rmdir(path)){
    Serial.println("Dir removed");
  } else {
    Serial.println("rmdir failed");
  }
}
void readFile(fs::FS &fs, const char * path){
  Serial.printf("Reading file: %s\n", path);
  File file = fs.open(path);
  if(!file){
    Serial.println("Failed to open file for reading");
    return;
  }
  Serial.print("Read from file: ");
  while(file.available()){
    Serial.write(file.read());
  }
  file.close();
}
void writeFile(fs::FS &fs, const char * path, const char * message){
  Serial.printf("Writing file: %s\n", path);
  File file = fs.open(path, FILE_WRITE);
  if(!file){
    Serial.println("Failed to open file for writing");
    return;
  }
  if(file.print(message)){
    Serial.println("File written");
  } else {
    Serial.println("Write failed");
  }
  file.close();
}
void appendFile(fs::FS &fs, const char * path, const char * message){
  Serial.printf("Appending to file: %s\n", path);
  File file = fs.open(path, FILE_APPEND);
  if(!file){
    Serial.println("Failed to open file for appending");
    return;
  }
  if(file.print(message)){
      Serial.println("Message appended");
  } else {
    Serial.println("Append failed");
  }
  file.close();
}
void renameFile(fs::FS &fs, const char * path1, const char * path2){
  Serial.printf("Renaming file %s to %s\n", path1, path2);
  if (fs.rename(path1, path2)) {
    Serial.println("File renamed");
  } else {
    Serial.println("Rename failed");
  }
}
void deleteFile(fs::FS &fs, const char * path){
  Serial.printf("Deleting file: %s\n", path);
  if(fs.remove(path)){
    Serial.println("File deleted");
  } else {
    Serial.println("Delete failed");
  }
}
void testFileIO(fs::FS &fs, const char * path){
  File file = fs.open(path);
  static uint8_t buf[512];
  size_t len = 0;
  uint32_t start = millis();
  uint32_t end = start;
  if(file){
    len = file.size();
    size_t flen = len;
    start = millis();
    while(len){
      size_t toRead = len;
      if(toRead > 512){
        toRead = 512;
      }
      file.read(buf, toRead);
      len -= toRead;
    }
    end = millis() - start;
    Serial.printf("%u bytes read for %u ms\n", flen, end);
    file.close();
  } else {
    Serial.println("Failed to open file for reading");
  }
  file = fs.open(path, FILE_WRITE);
  if(!file){
    Serial.println("Failed to open file for writing");
    return;
  }
  size_t i;
  start = millis();
  for(i=0; i<2048; i++){
    file.write(buf, 512);
  }
  end = millis() - start;
  Serial.printf("%u bytes written for %u ms\n", 2048 * 512, end);
  file.close();
}
*/


void setup()

// Fuer





{

  /* influxdb
  // Check server connection
  if (client.validateConnection()) {
    Serial.print("Connected to InfluxDB: ");
    Serial.println(client.getServerUrl());
  } else {
    Serial.print("InfluxDB connection failed: ");
    Serial.println(client.getLastErrorMessage());
  }

  sensor.addTag("device", DEVICE);
  sensor.addTag("SSID", WiFi.SSID());
  */

  // PinMode 
  pinMode(analogPin, INPUT_PULLDOWN);
  analogRead(analogPin);

  // airSensor.begin(); // SCD 30 CO2 Sensor
  lcd.init(); // initialize the lcd

  lcd.backlight(); // Backlight on
  pinMode(2, OUTPUT);
  Serial.begin(9600);
  lcd.clear();
  lcd.setCursor(0, 0);
  lcd.println("Booting now ");
  WiFi.mode(WIFI_STA);
  WiFi.begin(ssid, password);
  // Wait for connection
  while (WiFi.status() != WL_CONNECTED)
  {
    delay(500);
    Serial.print("Not");
    Wire1.begin(); // Start the wire hardware that may be supported by your platform
  }
  // NTP-Zeit-Server
  const char *ntpServer = "ptbtime1.ptb.de";
  lcd.clear();
  lcd.setCursor(0, 0);
  lcd.println("NTP: DE");
  lcd.setCursor(0, 1);
  lcd.print("Connected to: ");
  lcd.println(ssid);
  lcd.setCursor(0, 2);
  lcd.print("IP address: ");
  lcd.setCursor(0, 3);
  lcd.println(WiFi.localIP());

  //  t3  = airSensor.getCO2();
  //  Serial.println(t3);

  while (WiFi.waitForConnectResult() != WL_CONNECTED)
  {
    lcd.clear();
    lcd.setCursor(0, 0);
    lcd.println("Connection Failed! Rebooting...");
    delay(5000);
    ESP.restart();
  }

  // Port defaults to 8266
  // ArduinoOTA.setPort(8266);

  // Hostname defaults to esp8266-[ChipID]
  // ArduinoOTA.setHostname("myesp8266");

  // No authentication by default
  // ArduinoOTA.setPassword((const char *)"123");

  ArduinoOTA.onStart([]()
                     { lcd.println("Start"); });
  ArduinoOTA.onEnd([]()
                   { lcd.println("\nEnd"); });
  ArduinoOTA.onProgress([](unsigned int progress, unsigned int total)
                        { lcd.printf("Progress: %u%%\r", (progress / (total / 100))); });
  ArduinoOTA.onError([](ota_error_t error)
                     {
                       lcd.clear();
                       lcd.setCursor(0, 0);
                       lcd.printf("Error[%u]: ", error);
                       if (error == OTA_AUTH_ERROR)
                         lcd.println("Auth Failed");
                       else if (error == OTA_BEGIN_ERROR)
                         lcd.println("Begin Failed");
                       else if (error == OTA_CONNECT_ERROR)
                         lcd.println("Connect Failed");
                       else if (error == OTA_RECEIVE_ERROR)
                         lcd.println("Receive Failed");
                       else if (error == OTA_END_ERROR)
                         lcd.println("End Failed"); });

  ArduinoOTA.begin();

  lcd.clear();
  lcd.setCursor(0, 0);
  lcd.println("Ready");
  lcd.setCursor(0, 1);
  lcd.print("IP");
  lcd.setCursor(0, 2);
  lcd.println(WiFi.localIP());
  delay(2000);

  // 9,10,11 ohne IN,OUT sowie 34,35,36,39 nur IN sowie 2 jedoch IN, OUT aber funktioniert nicht
  // 21, 22 und 16, 17 sind fuer I2C verwendbar
  // 1, 3 sind fuer RX und TX vorgesehen nicht IN-OUT benutzbar
  // 0 ist nicht fuer IN und OUT vorgesehen, funktionieren aber
  // 9, 10, 11 DO NOT USE ?????  liegen aber dauerhaft 3,3 Volt an
  // fuer LCD

  pinMode(32, OUTPUT);
  pinMode(33, OUTPUT);
  pinMode(2, OUTPUT);
  digitalWrite(32, LOW);
  digitalWrite(33, LOW);
  digitalWrite(2, LOW);

  Serial.begin(9600);
  // initialize the Matrix, sollte nur einmal aufgerufen werden

  dht.begin();
  lcd.clear();
  lcd.setCursor(0, 0);
  lcd.println("DHTxx Unified Sensor Example");
  // Print temperature sensor details.
  sensor_t sensor;
  dht.temperature().getSensor(&sensor);

  // Print humidity sensor details.
  dht.humidity().getSensor(&sensor);

  // Aufruf Funktion PointSetu()

  // Zeitserver
  // Configure SNTP client in the same way as built-in one
#ifdef ESP8266
  pftime::configTzTime(TZ_Asia_Tokyo, ntpServer);
#else // ESP32
  pftime::configTzTime(PSTR("JST-1"), ntpServer);
#endif


  // Send web page with input fields to client
  server.on("/", HTTP_GET, [](AsyncWebServerRequest *request){
    request->send_P(200, "text/html", index_html);
  });

  // Send a GET request to <ESP_IP>/get?input1=<inputMessage>
  server.on("/get", HTTP_GET, [] (AsyncWebServerRequest *request) {
   
   
    String inputMessage;
    String inputParam;
    // GET input1 value on <ESP_IP>/get?input1=<inputMessage>
    if (request->hasParam(PARAM_INPUT_1)) {
      inputMessage = request->getParam(PARAM_INPUT_1)->value();
      //inputParam = PARAM_INPUT_1;
    }
   
    else {
      inputMessage = "No message sent";
      inputParam = "none";
    }
   
  
    temp = inputMessage.toFloat();
   

   
    delay(1000);
    request->send(200, "text/html", "HTTP GET request sent to your ESP on input field (" 
                                     + inputParam + ") with value: " + inputMessage +
                                     "<br><a href=\"/\">Return to Home Page</a>");
  });
  server.onNotFound(notFound);
  server.begin();



}

void loop()
{
  ArduinoOTA.handle();
  // Pruefen ob WiFi connect
  while (WiFi.waitForConnectResult() != WL_CONNECTED)
  {

    Serial.println("Connection Failed! Rebooting...");
    delay(5000);
    ESP.restart();
  }

  // Aufruf Funktion printlocalTime
  printLocalTime();

  // stuct tm nach tsstruct
  time_t now = time(0);
  struct tm tstruct = *localtime(&now);

  // aus tsstruct std , min, sek und alle als float
  // fuer auswerten Tag - Nacht Schaltung
  float std = tstruct.tm_hour + 1;
  float mini = tstruct.tm_min;
  float min = mini / 60;
  float sek = tstruct.tm_sec;
  sek = sek / 3600;
  float alle = std + min + sek;
  // fuer Darstellung auf Display
  int st = std;
  int mi = mini;

  // Ausgabe Serial
 

  // Get temperature event and print its value DHT22.
  sensors_event_t event;
  temperatur = dht.temperature().getEvent(&event);
  if (isnan(event.temperature))
  {

    Serial.println("Error reading temperature!");
  }
  else
  {
    Serial.println();
    Serial.println("Werte fuer Temperatur und Rel.Feuchtigkeit");
    Serial.print("Temperature: Grad C ");
    Serial.print(event.temperature);
    temperatur = event.temperature;
    Serial.println();
  }
  // Get humidity event and print its value DHT22.
  dht.humidity().getEvent(&event);
  if (isnan(event.relative_humidity))
  {
    Serial.println("Error reading humidity!");
  }
  else
  {
    Serial.print("Humidity: ");
    Serial.print(event.relative_humidity);
    Serial.println("%");
    huminity = event.relative_humidity;
    Serial.println();
  }

  if (((temperatur < temp)) && ((alle > tOnTag) && (alle < tAusNacht)))
  {
    // Die Temperatur ist unter dem Sollwert und die Zeit ist Nachtzeit
    lcd.clear();
    lcd.backlight();
    lcd.setCursor(0, 0);
    lcd.print("Die Heizung ist an");
    lcd.setCursor(0, 1);
    lcd.print("Temp  Ist C: ");
    lcd.setCursor(14, 1);
    lcd.print(temperatur);
    lcd.setCursor(0, 2);
    lcd.print("Temp Soll C: ");
    lcd.setCursor(14, 2);
    lcd.print(temp);
    lcd.setCursor(0, 3);
    lcd.print("Kleines Zimmer");
    digitalWrite(32, HIGH);
    digitalWrite(33, HIGH);
    digitalWrite(2, HIGH);
    delay(300000);
  }

  else

  {
    if ((alle > tOnTag) && (alle < tAusNacht))
    {
      // Die Zeit ist am Tag aber die Temperatur ist ueber dem Sollwert
      lcd.clear();
      lcd.backlight();
      lcd.setCursor(0, 0);
      lcd.print("Heizung ist aus");
      lcd.setCursor(0, 1);
      lcd.print("Temp Ist  C: ");
      lcd.setCursor(14, 1);
      lcd.print(temperatur);
      lcd.setCursor(0, 2);
      lcd.print("Temp Soll C: ");
      lcd.setCursor(14, 2);
      lcd.print(temp);
      lcd.setCursor(0, 3);
      lcd.print("Kleines Zimmer");
      digitalWrite(32, LOW);
      digitalWrite(33, LOW);
      digitalWrite(2, LOW);
      delay(4000);
    }
    else
    {
      lcd.clear();
      lcd.noBacklight();
      // Die Zeit ist in der Nacht
      lcd.setCursor(0, 0);
      lcd.print("Nacht aus");
      lcd.setCursor(0, 1);
      lcd.print(tAusNacht);
      lcd.setCursor(6, 1);
      lcd.print("-");
      lcd.setCursor(9, 1);
      lcd.print(tOnTag);
      lcd.setCursor(15, 1);
      lcd.print("Uhr");
      lcd.setCursor(0, 2);
      lcd.print("SollTemp: C ");
      lcd.print(temp);
      lcd.setCursor(0, 3);
      lcd.print("IstTemp:  C ");
      lcd.print(temperatur);
      digitalWrite(32, LOW);
      digitalWrite(33, LOW);
      digitalWrite(2, LOW);
      delay(4000);
    }
  }

  ArduinoOTA.handle();

  lcd.clear();
  lcd.setCursor(0, 0);
  lcd.print("Nacht-In :  ");
  lcd.setCursor(12, 0);
  lcd.println(tAusNacht);
  lcd.setCursor(0, 1);
  lcd.print("Tag-On :     ");
  lcd.print(tOnTag);
  lcd.setCursor(0, 2);
  lcd.print("Temp-Ist   C ");
  lcd.print(temperatur);
  lcd.setCursor(0, 3);
  lcd.print("Temp-Soll  C:");
  lcd.print(temp);
  delay(4000);

  ArduinoOTA.handle();

  lcd.clear();
  lcd.setCursor(0, 0);
  lcd.print("aktuelle Zeit: ");
  lcd.setCursor(7, 1);
  lcd.printf("%02d:%02d\n", st, mi);
  lcd.setCursor(12, 1);
  lcd.print(" Uhr");
  lcd.setCursor(0, 2);
  lcd.print("rel. Humanitity");
  lcd.setCursor(7, 3);
  lcd.print(huminity);
  lcd.setCursor(13, 3);
  lcd.print("%");


  delay(2000);
  pinMode(analogPin, INPUT_PULLDOWN);
  delay(2000);
  voltage = analogRead(analogPin);
  voltage = voltage;
  lcd.clear();
  lcd.setCursor(0, 0);
  lcd.print("Aromat (ppm):");
  lcd.print((voltage + (temperatur * 0.0106 * voltage) / 100)*2.5); // 500-600 ppm normal
  lcd.setCursor(5, 1);
  lcd.print("max. 1200 ppm ");
  lcd.setCursor(0, 2);
  lcd.print("CO2(ppm):");
  lcd.print(CO2 + 1500);
  lcd.setCursor(5, 3);
  lcd.print("max. 2500 ppm ");
  delay(2000);

  ArduinoOTA.handle();
  delay(2000);

  /* ab hier influxdb

    // Store measured value into point
   sensor.clearFields();
  // Report RSSI of currently connected network
   sensor.addField("rssi", WiFi.RSSI());
  // Print what are we exactly writing
   Serial.print("Writing: ");
   Serial.println(client.pointToLineProtocol(sensor));
  // If no Wifi signal, try to reconnect it
  if (WiFi.waitForConnectResult() != WL_CONNECTED) {
    lcd.clear();
    lcd.setCursor(0, 0);
    lcd.println("Wifi connection lost");
    delay(1000);
  }
 

// Write point
  pointDevice.addField("temp", temperatur);
  
  pointDevice.addField("hum", huminity);


  client.writePoint(pointDevice);
   if (client.writePoint(sensor)) {
    lcd.clear();
    lcd.setCursor(0, 0); 
    lcd.print("InfluxDB write failed: ");
    lcd.setCursor(0, 1);
    lcd.println(client.getLastErrorMessage());
    delay(2000);

    }
 */   
 

}